# Taps
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "aws/tap"
tap "fishtown-analytics/dbt"

# set arguments for all 'brew cask install' commands
cask_args appdir: "~/Applications"

# Casks
cask "adoptopenjdk8"
cask "iterm2-nightly"
cask "pycharm-ce"
cask "zoomus"
cask "slack"
cask "google-chrome"
cask "dbeaver-community"
cask "docker"

# Formulas
brew "python"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "wget"
brew "tree"
brew "git"
brew "awscli"
brew "aws-sam-cli"
brew "dbt"
brew "docker"
brew "docker-compose"
brew "jq"
brew "pyenv"
brew "pre-commit"
